package com.vovan.lab7

import org.junit.Test

import org.junit.Assert.*

/**
 * Example local unit test, which will execute on the development machine (host).
 *
 * See [testing documentation](http://d.android.com/tools/testing).
 */
class ExampleUnitTest {
    // ☝️ Клас для юніт-тестів. Тут ми тестуємо логіку без використання Android SDK.

    @Test
    // 👈 Анотація: Позначає функцію як окремий тест, який може бути виконаний автоматично.
    fun addition_isCorrect() {
        // ☝️ Назва функції має бути описовою, що саме вона тестує.

        // 1. Асерт (Перевірка)
        assertEquals(4, 2 + 2)
        // 👈 assertEquals: Головний метод тестування. Він порівнює очікуване значення (4) з фактичним (результат 2 + 2).
        // Якщо вони збігаються, тест вважається успішним. Це найпростіший тест на працездатність.
    }
}