package com.vovan.lab7

import android.app.Application
import com.vovan.lab7.di.appModule
import org.koin.android.ext.koin.androidContext
import org.koin.android.ext.koin.androidLogger
import org.koin.core.context.GlobalContext.startKoin

class App: Application() {
    // ☝️ Клас App наслідує Application. Це найперший клас, який запускається, коли операційна система
    // завантажує ваш додаток у пам'ять (навіть раніше, ніж MainActivity).

    override fun onCreate() {
        super.onCreate()

        // --- Ініціалізація Koin ---
        startKoin {
            // 👈 Головна функція Koin, яка запускає його роботу.

            androidLogger()
            // 👈 Налаштування: Дозволяє Koin виводити інформацію про свою роботу (наприклад, які об'єкти створюються)
            // у Logcat (допомагає при налагодженні).

            androidContext(this@App)
            // 👈 Налаштування: Надає Koin доступ до контексту Android (Application Context).
            // Koin використовує цей контекст, щоб створити, наприклад, базу даних або інші системні об'єкти.

            modules(appModule)
            // 👈 Підключення: Вказує Koin, який саме набір інструкцій (які об'єкти створювати) він має використовувати.
            // 'appModule' - це ваш файл, де описано створення Retrofit, ViewModel, Repository тощо.
        }
    }
}