package com.lab6.data.entity

// Це data class, який слугує моделлю для парсингу (читання) частини JSON-відповіді.
// Він відповідає за зберігання ОСНОВНИХ метеорологічних показників.
data class WeatherMain(

    val temp: Double, // 👈 Фактична температура (зазвичай у Кельвінах, потрібно буде конвертувати у Цельсій/Фаренгейт).
    // Використовуємо Double, оскільки температура є дробовим числом.

    val feels_like: Double, // 👈 Відчувається як (температура з поправкою на вітер та вологість).

    val pressure: Int, // 👈 Атмосферний тиск (у гектопаскалях (hPa)). Ціле число.

    val humidity: Int, // 👈 Вологість повітря (у відсотках). Ціле число.

    // В JSON-відповіді всі ці поля згруповані під ключем "main".
)