package com.lab6.data.entity

// Це data class, який слугує моделлю для парсингу (читання) одного запису про погоду.
// У прогнозі від OpenWeatherMap один такий запис відповідає погоді на 3 години.
data class WeatherForecast(

    val dt: Long, // 👈 Поле 'dt' (дата та час)
    // Це UNIX-час (кількість секунд з 1970 року), який вказує, на який момент часу зроблено цей прогноз.
    // У додатку цей час треба буде перетворити на зрозумілий формат (наприклад, "Четвер, 15:00").

    val main: WeatherMain, // 👈 Основні показники погоди
    // Це вкладений data class, який містить ключові дані: температуру, тиск, вологість.

    // В API є багато інших полів (wind, weather, pop...), але ми взяли тільки ті,
    // які є мінімально необхідними для відображення прогнозу.
)